import streamlit as st

#ส่วนที่ 1 หัวข้อหน้าเว้ป (title สีแดง)
st.markdown("# :red[💪คำนวณดัชนีมวลกาย BMI ️‍🔥]")
st.write("กรอกข้อมูลน้ำหนักและส่วนสูงของคุณ เพื่อเช็คสุขภาพเบื้องต้น")

#ส่วนที่ 2 สร้างช่องใส่น้ำหนัก และ ส่วนสูง
weight = st.number_input("กรอกน้ำหนักของคุณ (กิโลกรัม):", min_value=1.0, value=1.0)
height_cm = st.number_input("กรอกส่วนสุงของคุณ (เซนติเมตร):", min_value=1.0, value=1.0)

#ส่วนที่ 3 สร้างปุ่มกดคำนวณ
if st.button("คฎนวณค่า BMI🏋️")
 #แปลงส่วนสูงจาก cm เป็ฯ เมตร แล้วคำนวณ BMI
